In [1]:
import pandas as pd

In [18]:
ls

Data Via conti..ipynb              Pfizer_1.csv
Data Viz with seaborn.ipynb        Probability Day 1.ipynb
MatplotLib conti. + Seaborn.ipynb  directors.csv
Matplotlib.ipynb                   drive.google.com/
Matplotlib_Revision.ipynb          figure.png
Netflix project.ipynb              gapminder.csv
Pandas_4.ipynb                     jupyterthemes.ipynb
Pandas_5.ipynb                     movies.csv
Pandas_Rev_conti.ipynb             numpy_pandas_revision.ipynb
Pandas_Revision.ipynb              prob_01_basic_definitions/

In [19]:
cd prob_01_basic_definitions/

/Users/jitendranathmahato/Downloads/Scaler/prob_01_basic_definitions

In [20]:
ls

Sachin_ODI.csv                    prob_01_basic_definitions.pdf
covid.csv                         sachin.ipynb
post_read_covid_case_study.ipynb

In [21]:
df_sachin=pd.read_csv("Sachin_ODI.csv")
df_sachin.head()

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False

In [22]:
df_sachin.shape

(360, 14)

In [23]:
df_sachin["Won"].value_counts()

True     184
False    176
Name: Won, dtype: int64

In [26]:
#Probablity of winning
184/360

0.5111111111111111

In [27]:
df_won=df_sachin[df_sachin["Won"]==True]
df_won

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
5,112,1,137,107,15,1,104.67,2,Sri Lanka,Sharjah,1995-04-09,India,True,True
6,41,0,51,41,5,0,100.00,2,Sri Lanka,Sharjah,1995-04-14,India,True,False
8,39,0,79,51,4,0,76.47,2,New Zealand,Amritsar,1995-11-18,India,True,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
349,18,0,21,14,2,0,128.57,2,Sri Lanka,Mumbai,2011-04-02,India,True,False
351,48,0,87,63,5,0,76.19,2,Sri Lanka,Perth,2012-02-08,India,True,False
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,True,False
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,True,False
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,True,False

In [30]:
df_sachin.head(2)

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False

In [28]:
len(df_won)

184

In [29]:
prob_winning=len(df_won)/len(df_sachin)
prob_winning

0.5111111111111111

In [31]:
df_sachin["century"].value_counts()

False    314
True      46
Name: century, dtype: int64

In [32]:
#probablity of Sachin century
46/360

0.12777777777777777

In [35]:
df_century=df_sachin[df_sachin["century"]==True]
df_century.shape

(46, 14)

In [37]:
prob_century=len(df_century)/len(df_sachin)
prob_century

0.12777777777777777

In [38]:
df_sachin[["century","Won"]].value_counts()

century  Won
False    False    160
         True     154
True     True      30
         False     16
dtype: int64

In [39]:
pd.crosstab(index=df_sachin["century"],columns=df_sachin["Won"])

Won      False  True
century
False      160   154
True        16    30

In [40]:
pd.crosstab(index=df_sachin["century"],columns=df_sachin["Won"],margins=True)

Won      False  True  All
century
False      160   154  314
True        16    30   46
All        176   184  360